app/models/user.rb

  def password=(password)
    @password = password
    self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"